Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::v1::RoutingSegment Class Referencefinal
MEP Element Manager
The RoutingSegment can contain Rigid Segment elements. More...
#include <MEPRoutingSegment.hpp>
 Inheritance diagram for ACAPI::MEP::v1::RoutingSegment:
 Public Member Functions
double  | GetCrossSectionWidth () const
double  | GetCrossSectionHeight () const
ConnectorShape  | GetCrossSectionShape () const
std::vector< UniqueID >  | GetRigidSegmentIds () const
UniqueID  | GetBeginNodeId () const
UniqueID  | GetEndNodeId () const
UniqueID  | GetRoutingElementId () const
Domain  | GetDomain () const
RoutingSegmentDefault  | PickUpDefault () const
Picks up and returns the Default of the RoutingSegment.
RigidSegmentDefault  | GetRigidSegmentDefaultParameters () const
UniqueID  | GetPreferenceTableId () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetCrossSectionWidth (double width)
Sets the width of Cross Section in the Routing Segment.
void  | SetCrossSectionHeight (double height)
Sets the width of Cross Section in the Routing Segment.
void  | SetCrossSectionShape (ConnectorShape shape)
Sets the shape of Cross Section in the Routing Segment.
Result< void >  | Inject (const RoutingSegmentDefault &routingSegmentDefault)
Injects the given Default settings to the RoutingSegment.
Result< void >  | SetRigidSegmentDefaultParameters (const RigidSegmentDefault &rigidSegmentDefault)
Sets the parameters of the RigidSegments.
Result< void >  | SetPreferenceTableId (const UniqueID &uniqueId)
Sets the PreferenceTable of the RoutingSegment.
 Static Public Member Functions
static Result< RoutingSegment >  | Get (const UniqueID &uniqueId)
Returns a Routing Segment.
Detailed Description
The RoutingSegment can contain Rigid Segment elements.
This type of element is placed between the corner points of RouteElement.
Since
Archicad 27
Example code snippet from Test / New MEP
Getters
 ACAPI::Result<RoutingSegment> routingSegment = RoutingSegment::Get (id);
 if (routingSegment.IsErr ()) {
 ACAPI_WriteReport (routingSegment.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter routingSegmentReporter (1);
 routingSegmentReporter.Add ("Routing Segment", id);
 routingSegmentReporter.SetTabCount (2);
 routingSegmentReporter.Add ("Cross Section Width", routingSegment->GetCrossSectionWidth ());
 routingSegmentReporter.Add ("Cross Section Height", routingSegment->GetCrossSectionHeight ());
 routingSegmentReporter.Add ("Cross Section Shape", routingSegment->GetCrossSectionShape ());
 routingSegmentReporter.Add ("Table of dimensions ID", routingSegment->GetPreferenceTableId ());
 routingSegmentReporter.Add ("Guid of Begin Node", routingSegment->GetBeginNodeId ());
 routingSegmentReporter.Add ("Guid of End Node", routingSegment->GetEndNodeId ());
 routingSegmentReporter.Write ();
 // Rigid Segments
 std::vector<UniqueID> rigidSegmentIds = routingSegment->GetRigidSegmentIds ();
 if (!rigidSegmentIds.empty ()) {
 ACAPI_WriteReport ("\t\tList of Rigid Segments:\n", false);
 for (const UniqueID& id : rigidSegmentIds)
 WriteRigidSegmentDetails (id);
 }
 Modification
 double currentWidth = routingSegment.GetCrossSectionWidth ();
 double currentHeight = routingSegment.GetCrossSectionHeight ();
 ACAPI::Result<void> modifyResult = routingSegment.Modify ([&](RoutingSegment::Modifier& modifier) {
 modifier.SetCrossSectionWidth (0.5 * currentWidth);
 modifier.SetCrossSectionHeight (0.5 * currentHeight);
 }, "Modify the dimensions of Cross Section of Routing Segment.");
 if (modifyResult.IsErr ())
 return modifyResult.UnwrapErr ().kind;
 return NoError;
Member Function Documentation
◆ Get()
 static Result< RoutingSegment > ACAPI::MEP::v1::RoutingSegment::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a Routing Segment.
Parameters
uniqueId | The UniqueID of the requested RoutingSegment.
Returns
If the uniqueId belongs to a RoutingSegment, returns the object associated to it, otherwise Error.
◆ GetBeginNodeId()
 UniqueID ACAPI::MEP::v1::RoutingSegment::GetBeginNodeId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingNode from which the RoutingSegment starts.
◆ GetCrossSectionHeight()
 double ACAPI::MEP::v1::RoutingSegment::GetCrossSectionHeight  |  ( |   | ) |   const
Returns
Returns the height of Cross Section in the RoutingSegment.
◆ GetCrossSectionShape()
 ConnectorShape ACAPI::MEP::v1::RoutingSegment::GetCrossSectionShape  |  ( |   | ) |   const
Returns
Returns the shape of Cross Section in the RoutingSegment.
◆ GetCrossSectionWidth()
 double ACAPI::MEP::v1::RoutingSegment::GetCrossSectionWidth  |  ( |   | ) |   const
Returns
Returns the width of Cross Section in the RoutingSegment.
◆ GetDomain()
 Domain ACAPI::MEP::v1::RoutingSegment::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the RoutingSegment.
◆ GetEndNodeId()
 UniqueID ACAPI::MEP::v1::RoutingSegment::GetEndNodeId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingNode at which the RoutingSegment ends.
◆ GetPreferenceTableId()
 UniqueID ACAPI::MEP::v1::RoutingSegment::GetPreferenceTableId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the PreferenceTable is associated with.
◆ GetRigidSegmentDefaultParameters()
 RigidSegmentDefault ACAPI::MEP::v1::RoutingSegment::GetRigidSegmentDefaultParameters  |  ( |   | ) |   const
Returns
Returns the default parameters of the uncustomized RigidSegments.
◆ GetRigidSegmentIds()
 std::vector< UniqueID > ACAPI::MEP::v1::RoutingSegment::GetRigidSegmentIds  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the RigidSegments contained by the RoutingSegment.
◆ GetRoutingElementId()
 UniqueID ACAPI::MEP::v1::RoutingSegment::GetRoutingElementId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingElement that it belongs to.
◆ Inject()
 Result< void > ACAPI::MEP::v1::RoutingSegment::Inject  |  ( |  const RoutingSegmentDefault &  |  routingSegmentDefault | )
Injects the given Default settings to the RoutingSegment.
Parameters
routingSegmentDefault | The Default which will be injected.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::RoutingSegment::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 RoutingSegmentDefault ACAPI::MEP::v1::RoutingSegment::PickUpDefault  |  ( |   | ) |   const
Picks up and returns the Default of the RoutingSegment.
Returns
Returns a RoutingSegmentDefault with the parameters of the object it was called for.
◆ SetCrossSectionHeight()
 void ACAPI::MEP::v1::RoutingSegment::SetCrossSectionHeight  |  ( |  double  |  height | )
Sets the width of Cross Section in the Routing Segment.
Parameters
height | The value to be set.
◆ SetCrossSectionShape()
 void ACAPI::MEP::v1::RoutingSegment::SetCrossSectionShape  |  ( |  ConnectorShape  |  shape | )
Sets the shape of Cross Section in the Routing Segment.
Parameters
shape | The value to be set.
◆ SetCrossSectionWidth()
 void ACAPI::MEP::v1::RoutingSegment::SetCrossSectionWidth  |  ( |  double  |  width | )
Sets the width of Cross Section in the Routing Segment.
Parameters
width | The value to be set.
◆ SetPreferenceTableId()
 Result< void > ACAPI::MEP::v1::RoutingSegment::SetPreferenceTableId  |  ( |  const UniqueID &  |  uniqueId | )
Sets the PreferenceTable of the RoutingSegment.
Parameters
uniqueId | The UniqueID of the PreferenceTable.
Returns
Returns an error if the parameter does not identify a PreferenceTable, otherwise nothing.
◆ SetRigidSegmentDefaultParameters()
 Result< void > ACAPI::MEP::v1::RoutingSegment::SetRigidSegmentDefaultParameters  |  ( |  const RigidSegmentDefault &  |  rigidSegmentDefault | )
Sets the parameters of the RigidSegments.
Parameters
rigidSegmentDefault | The Default to be set. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error in case of domain mismatch or if the set operation fails for some internal reason, otherwise nothing.